/*------------------------------------------------------------[TASK_1]------------------------------------------------------------------------------------------------
Написать функцию **getSum**, которая будет высчитывать сумму чисел от нуля, до параметра, который мы в неё передаем. 
> Если передадим число 100 то, надо вычислить сумму чисел от 0 до 100 (должно получится 5050)*/
console.log(`TASK_1`);
{
    function calcSumFromZeroToNum(num: number): number {
        let total_sum: number = 0;
        for (let i: number = 0; i <= num; i++) {
            total_sum += i;
        };
        return total_sum;
    }
    console.log(`Сумма чисел от 0 до введённого числа = ${calcSumFromZeroToNum(123)}`);
}
/*------------------------------------------------------------[TASK_2]------------------------------------------------------------------------------------------------
Напишите функцию которая в качестве аргумента принимает в себя сумму кредита который хочет получить клиент и 
верните результат переплаты по кредиту:
+ процентная ставка в год — 17%,
+ количество лет — 5.*/
console.log(`TASK_2`);
{
    let getOverPaymentByCredit = (numOfMoney: number, ratePerYear: number = 17, creditPeriod: number = 5): number => (ratePerYear * numOfMoney * creditPeriod) / 100;
    console.log(getOverPaymentByCredit(10000));
}
/*------------------------------------------------------------[TASK_3]------------------------------------------------------------------------------------------------
Написать функцию **trimString** которая в качестве аргумента принимает три параметра:
+ строку
+ значение от
+ значение по*/
console.log(`TASK_3`);
{
    function getSlicedString(anyStr: String, from: number, by: number): any {
        let slicedString = `${anyStr}`;
        let slicing = slicedString.slice(from, by);
        return [slicedString, slicing];
    }
}
    console.log(getSlicedString('Совершенно случайная строка', 2,5));
/*------------------------------------------------------------[TASK_4]------------------------------------------------------------------------------------------------
Написать функцию **getSumNumbers**, которая будет принимать число и вычислять сумму цифр из которых состоит число.
> Для 2021 это будет 5.*/
console.log(`TASK_3`);
{

    
}